<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  <title>【看看你公司好不好】一张图就能让你轻松识别：好公司VS烂公司 | SarielTang的个人博客</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="&amp;#x4E00;&amp;#x5BB6;&amp;#x597D;&amp;#x516C;&amp;#x53F8;&amp;#x7684;20&amp;#x6761;&amp;#x94C1;&amp;#x89C4;
&amp;#x3000;&amp;#x3000;&amp;#x7B2C;1&amp;#x6761;&amp;#x94C1;&amp;#x89C4;&amp;#xFF1A;&amp;#x516C;&amp;#x53F8;&amp;#x5229;&amp;#x76CA;&amp;#x9AD8;&amp;#x4E8E;&amp;#x4E00;&amp;#x5207;">
<meta property="og:type" content="article">
<meta property="og:title" content="【看看你公司好不好】一张图就能让你轻松识别：好公司VS烂公司">
<meta property="og:url" content="http://sarieltang.github.io/2015/01/06/转/2015-01-06/index/index.html">
<meta property="og:site_name" content="SarielTang的个人博客">
<meta property="og:description" content="&amp;#x4E00;&amp;#x5BB6;&amp;#x597D;&amp;#x516C;&amp;#x53F8;&amp;#x7684;20&amp;#x6761;&amp;#x94C1;&amp;#x89C4;
&amp;#x3000;&amp;#x3000;&amp;#x7B2C;1&amp;#x6761;&amp;#x94C1;&amp;#x89C4;&amp;#xFF1A;&amp;#x516C;&amp;#x53F8;&amp;#x5229;&amp;#x76CA;&amp;#x9AD8;&amp;#x4E8E;&amp;#x4E00;&amp;#x5207;">
<meta property="og:image" content="http://www.aiyingli.com/wp-content/uploads/2014/11/20141118135352005200.png">
<meta property="og:image" content="http://www.aiyingli.com/wp-content/uploads/2014/11/201411181350313561.png">
<meta property="og:image" content="http://www.aiyingli.com/wp-content/uploads/2014/11/201411181350336236.png">
<meta property="og:updated_time" content="2016-10-27T04:18:25.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="【看看你公司好不好】一张图就能让你轻松识别：好公司VS烂公司">
<meta name="twitter:description" content="&amp;#x4E00;&amp;#x5BB6;&amp;#x597D;&amp;#x516C;&amp;#x53F8;&amp;#x7684;20&amp;#x6761;&amp;#x94C1;&amp;#x89C4;
&amp;#x3000;&amp;#x3000;&amp;#x7B2C;1&amp;#x6761;&amp;#x94C1;&amp;#x89C4;&amp;#xFF1A;&amp;#x516C;&amp;#x53F8;&amp;#x5229;&amp;#x76CA;&amp;#x9AD8;&amp;#x4E8E;&amp;#x4E00;&amp;#x5207;">
<meta name="twitter:image" content="http://www.aiyingli.com/wp-content/uploads/2014/11/20141118135352005200.png">
  
    <link rel="alternate" href="/atom.xml" title="SarielTang的个人博客" type="application/atom+xml">
  
  
    <link rel="icon" href="/favicon.png">
  
  
    <link href="//fonts.googleapis.com/css?family=Source+Code+Pro" rel="stylesheet" type="text/css">
  
  <link rel="stylesheet" href="/css/style.css">
  

</head>

<body>
  <div id="container">
    <div id="wrap">
      <header id="header">
  <div id="banner"></div>
  <div id="header-outer" class="outer">
    <div id="header-title" class="inner">
      <h1 id="logo-wrap">
        <a href="/" id="logo">SarielTang的个人博客</a>
      </h1>
      
        <h2 id="subtitle-wrap">
          <a href="/" id="subtitle">自己重新制作的个人博客，会随意分享一些东西，有兴趣的可以关注看看，愿世界没有加班，阿门。</a>
        </h2>
      
    </div>
    <div id="header-inner" class="inner">
      <nav id="main-nav">
        <a id="main-nav-toggle" class="nav-icon"></a>
        
          <a class="main-nav-link" href="/">Home</a>
        
          <a class="main-nav-link" href="/archives">Archives</a>
        
      </nav>
      <nav id="sub-nav">
        
          <a id="nav-rss-link" class="nav-icon" href="/atom.xml" title="RSS Feed"></a>
        
        <a id="nav-search-btn" class="nav-icon" title="搜索"></a>
      </nav>
      <div id="search-form-wrap">
        <form action="//google.com/search" method="get" accept-charset="UTF-8" class="search-form"><input type="search" name="q" results="0" class="search-form-input" placeholder="Search"><button type="submit" class="search-form-submit">&#xF002;</button><input type="hidden" name="sitesearch" value="http://sarieltang.github.io"></form>
      </div>
    </div>
  </div>
</header>
      <div class="outer">
        <section id="main"><article id="post-转/2015-01-06/index" class="article article-type-post" itemscope itemprop="blogPost">
  <div class="article-meta">
    <a href="/2015/01/06/转/2015-01-06/index/" class="article-date">
  <time datetime="2015-01-06T14:27:00.000Z" itemprop="datePublished">2015-01-06</time>
</a>
    
  <div class="article-category">
    <a class="article-category-link" href="/categories/转/">转</a>
  </div>

  </div>
  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 class="article-title" itemprop="name">
      【看看你公司好不好】一张图就能让你轻松识别：好公司VS烂公司
    </h1>
  

      </header>
    
    <div class="article-entry" itemprop="articleBody">
      
      	<!-- Table of Contents -->
		
        <p><img src="http://www.aiyingli.com/wp-content/uploads/2014/11/20141118135352005200.png" alt="&#x4E00;&#x5F20;&#x56FE;&#x5C31;&#x80FD;&#x8BA9;&#x4F60;&#x8F7B;&#x677E;&#x8BC6;&#x522B;&#xFF1A;&#x597D;&#x516C;&#x53F8;VS&#x70C2;&#x516C;&#x53F8;"></p>
<p><img src="http://www.aiyingli.com/wp-content/uploads/2014/11/201411181350313561.png" alt="&#x4E00;&#x5F20;&#x56FE;&#x5C31;&#x80FD;&#x8BA9;&#x4F60;&#x8F7B;&#x677E;&#x8BC6;&#x522B;&#xFF1A;&#x597D;&#x516C;&#x53F8;VS&#x70C2;&#x516C;&#x53F8;"></p>
<p><img src="http://www.aiyingli.com/wp-content/uploads/2014/11/201411181350336236.png" alt="&#x4E00;&#x5F20;&#x56FE;&#x5C31;&#x80FD;&#x8BA9;&#x4F60;&#x8F7B;&#x677E;&#x8BC6;&#x522B;&#xFF1A;&#x597D;&#x516C;&#x53F8;VS&#x70C2;&#x516C;&#x53F8;"></p>
<p>&#x4E00;&#x5BB6;&#x597D;&#x516C;&#x53F8;&#x7684;20&#x6761;&#x94C1;&#x89C4;</p>
<p>&#x3000;&#x3000;&#x7B2C;1&#x6761;&#x94C1;&#x89C4;&#xFF1A;&#x516C;&#x53F8;&#x5229;&#x76CA;&#x9AD8;&#x4E8E;&#x4E00;&#x5207;</p>
<p>&#x3000;&#x3000;&#x516C;&#x53F8;&#x662F;&#x5168;&#x4F53;&#x5458;&#x5DE5;&#x7684;&#x751F;&#x5B58;&#x5E73;&#x53F0;&#xFF0C;&#x4E2A;&#x4EBA;&#x5229;&#x76CA;&#x4E0D;&#x80FD;&#x4EA6;&#x4E0D;&#x5F97;&#x4E0E;&#x4E4B;&#x53D1;&#x751F;&#x51B2;&#x7A81;&#x3002;&#x4E00;&#x65E6;&#x7978;&#x8D77;&#x8427;&#x5899;&#xFF0C;&#x8F7B;&#x5219;&#x7533;&#x65A5;&#x5904;&#x7F5A;&#xFF0C;&#x91CD;&#x5219;&#x9769;&#x804C;&#x8D70;&#x4EBA;&#x3002;&#x7838;&#x4E86;&#x8001;&#x677F;&#x6216;&#x5927;&#x4F19;&#x513F;&#x7684;&#x996D;&#x7897;&#xFF0C;&#x8C01;&#x4E5F;&#x522B;&#x60F3;&#x6709;&#x597D;&#x65E5;&#x5B50;&#x8FC7;&#x3002;</p>
<p>&#x3000;&#x3000;&#x7B2C;2&#x6761;&#x94C1;&#x89C4;&#xFF1A;&#x56E2;&#x961F;&#x81F3;&#x9AD8;&#x65E0;&#x4E0A;</p>
<p>&#x3000;&#x3000;&#x56E2;&#x961F;&#x662F;&#x5404;&#x90E8;&#x95E8;&#x7684;&#x751F;&#x547D;&#x7EBF;&#xFF0C;&#x5728;&#x56E2;&#x961F;&#x529B;&#x91CF;&#x652F;&#x6491;&#x4EA7;&#x4E1A;&#x5B9E;&#x4F53;&#x7684;&#x5E02;&#x573A;&#x7ECF;&#x6D4E;&#x65F6;&#x4EE3;&#xFF0C;&#x9664;&#x975E;&#x4F60;&#x662F;&#x6765;&#x81EA;&#x5F02;&#x57DF;&#x7684;&#x6708;&#x7403;&#x7A7A;&#x5FC3;&#x4EBA;&#x3002;</p>
<p>&#x3000;&#x3000;&#x7B2C;3&#x6761;&#x94C1;&#x89C4;&#xFF1A;&#x7528;&#x8001;&#x677F;&#x7684;&#x6807;&#x51C6;&#x8981;&#x6C42;&#x81EA;&#x5DF1;</p>
<p>&#x3000;&#x3000;&#x4E2A;&#x4EBA;&#x85AA;&#x6C34;&#x3001;&#x62BD;&#x6210;&#x3001;&#x5956;&#x91D1;&#x7684;&#x5206;&#x914D;&#x867D;&#x7136;&#x4E0E;&#x5DE5;&#x4F5C;&#x4E1A;&#x7EE9;&#x76F8;&#x5173;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x6700;&#x7EC8;&#x662F;&#x5728;&#x8001;&#x677F;&#x6240;&#x83B7;&#x53D6;&#x7684;&#x4F01;&#x4E1A;&#x5229;&#x76CA;&#x7684;&#x6E90;&#x5934;&#x57FA;&#x7840;&#x4E0A;&#x5B9E;&#x73B0;&#x3002;&#x6240;&#x4EE5;&#x4E3A;&#x8C0B;&#x6C42;&#x81EA;&#x8EAB;&#x5229;&#x76CA;&#x7684;&#x5151;&#x73B0;&#x548C;&#x6269;&#x5927;&#xFF0C;&#x5C31;&#x6709;&#x5FC5;&#x8981;&#x4EE5;&#x8001;&#x677F;&#x7684;&#x6807;&#x51C6;&#x6765;&#x8981;&#x6C42;&#x81EA;&#x5DF1;&#x3002;&#x5728;&#x56E2;&#x961F;&#x4E2D;&#xFF0C;&#x4F60;&#x7684;&#x4E3B;&#x7BA1;&#x3001;&#x4F60;&#x7684;&#x5BA2;&#x6237;&#xFF0C;&#x90FD;&#x662F;&#x4F60;&#x7684;&#x8001;&#x677F;&#xFF0C;&#x4F60;&#x7684;&#x5DE5;&#x4F5C;&#x6001;&#x5EA6;&#x5FC5;&#x987B;&#x8981;&#x8D85;&#x8D8A;&#x4ED6;&#x4EEC;&#xFF0C;&#x5426;&#x5219;&#x4F60;&#x5C06;&#x6C38;&#x8FDC;&#x662F;&#x4ED6;&#x4EEC;&#x7684;&#x6307;&#x8D23;&#x5BF9;&#x8C61;&#x3002;</p>
<p>&#x3000;&#x3000;&#x7B2C;4&#x6761;&#x94C1;&#x89C4;&#xFF1A;&#x628A;&#x4E8B;&#x60C5;&#x505A;&#x5728;&#x524D;&#x9762;</p>
<p>&#x3000;&#x3000;&#x4EC0;&#x4E48;&#x7B97;&#x662F;&#x656C;&#x4E1A;&#x7684;&#x6807;&#x51C6;&#xFF1F;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x6807;&#x51C6;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x4F60;&#x6240;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x662F;&#x5728;&#x522B;&#x4EBA;&#x4E4B;&#x524D;&#xFF0C;&#x8FD8;&#x662F;&#x4E4B;&#x540E;&#x3002;</p>
<p>&#x3000;&#x3000;&#x5982;&#x679C;&#x662F;&#x8001;&#x677F;&#x60F3;&#x5230;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x8BA9;&#x4F60;&#x53BB;&#x505A;&#x7684;&#xFF0C;&#x4F60;&#x505A;&#x5B8C;&#x4E86;&#xFF0C;&#x4F46;&#x8FD9;&#x7B97;&#x4E0D;&#x4E0A;&#x662F;&#x5728;&#x524D;&#x9762;&#xFF0C;&#x524D;&#x9762;&#x8FD8;&#x6709;&#x8001;&#x677F;&#x3002;&#x5982;&#x679C;&#x8001;&#x677F;&#x8FD8;&#x6CA1;&#x60F3;&#x5230;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x4F60;&#x505A;&#x5B8C;&#x4E86;&#xFF0C;&#x5F88;&#x68D2;&#xFF01;</p>
<p>&#x3000;&#x3000;&#x540C;&#x6837;&#x5730;&#xFF0C;&#x6BD4;&#x8F83;&#x5BF9;&#x8C61;&#x8FD8;&#x6709;&#x4E3B;&#x7BA1;&#x3001;&#x540C;&#x4E8B;&#xFF0C;&#x770B;&#x770B;&#x81EA;&#x5DF1;&#x7684;&#x52AA;&#x529B;&#x662F;&#x5728;&#x524D;&#x9762;&#x8FD8;&#x662F;&#x540E;&#x9762;&#x3002;&#x9762;&#x5BF9;&#x4E00;&#x5927;&#x644A;&#x5B50;&#x7BA1;&#x7406;&#x53CA;&#x540E;&#x52E4;&#x673A;&#x5173;&#x4EBA;&#x5458;&#xFF0C;&#x8BA9;&#x4EBA;&#x6311;&#x523A;&#x662F;&#x5F88;&#x59D4;&#x5C48;&#x5F88;&#x96BE;&#x53D7;&#x7684;&#xFF0C;&#x4F46;&#x8981;&#x77E5;&#x9053;&#xFF0C;&#x505A;&#x5728;&#x524D;&#x9762;&#x5C31;&#x53EF;&#x4EE5;&#x53BB;&#x6311;&#x522B;&#x4EBA;&#x7684;&#x523A;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x6539;&#x53D8;&#x5C40;&#x9762;&#x7684;&#x8BDD;&#x3002;</p>
<p>&#x3000;&#x3000;&#x7B2C;5&#x6761;&#x94C1;&#x89C4;&#xFF1A;&#x54CD;&#x5E94;&#x662F;&#x4E2A;&#x4EBA;&#x4EF7;&#x503C;&#x7684;&#x6700;&#x4F73;&#x4F53;&#x73B0;</p>
<p>&#x3000;&#x3000;&#x4E2A;&#x4EBA;&#x4EF7;&#x503C;&#x7684;&#x4F53;&#x73B0;&#x5EFA;&#x7ACB;&#x5728;&#x56E2;&#x961F;&#x5BF9;&#x4F60;&#x7684;&#x9700;&#x8981;&#x7A0B;&#x5EA6;&#x4E0A;&#xFF01;&#x6240;&#x4EE5;&#xFF0C;&#x6BCF;&#x5F53;&#x4E0A;&#x53F8;&#x53D1;&#x51FA;&#x5021;&#x8BAE;&#x6216;&#x56E2;&#x961F;&#x4E2D;&#x6709;&#x4EBA;&#x5BFB;&#x6C42;&#x5DE5;&#x4F5C;&#x652F;&#x63F4;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5728;&#x7B2C;&#x4E00;&#x65F6;&#x95F4;&#x505A;&#x51FA;&#x79EF;&#x6781;&#x54CD;&#x5E94;&#x5C31;&#x662F;&#x5FC5;&#x987B;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x5173;&#x7CFB;&#x5230;&#x4F60;&#x7684;&#x4EF7;&#x503C;&#x4F53;&#x73B0;&#x3002;</p>
<p>&#x3000;&#x3000;&#x7B2C;6&#x6761;&#x94C1;&#x89C4;&#xFF1A;&#x6CBF;&#x7740;&#x539F;&#x5219;&#x65B9;&#x5411;&#x524D;&#x8FDB;</p>
<p>&#x3000;&#x3000;&#x5BF9;&#x4E8E;&#x539F;&#x5219;&#x65B9;&#x5411;&#x53EA;&#x80FD;&#x63A5;&#x53D7;&#x5B83;&#xFF0C;&#x4E0D;&#x80FD;&#x6297;&#x62D2;&#x5B83;&#x3002;&#x5982;&#x679C;&#x4F60;&#x6253;&#x7B97;&#x575A;&#x6301;&#x4E0B;&#x6765;&#x5E76;&#x671F;&#x671B;&#x6709;&#x6240;&#x4F5C;&#x4E3A;&#x3002;</p>
<p>&#x3000;&#x3000;&#x90A3;&#x4E48;&#xFF0C;&#x5982;&#x4F55;&#x624D;&#x80FD;&#x505A;&#x597D;&#x4E8B;&#x60C5;&#xFF1F;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x6CBF;&#x7740;&#x516C;&#x53F8;&#x660E;&#x6587;&#x89C4;&#x5B9A;&#x7684;&#x539F;&#x5219;&#x65B9;&#x5411;&#x524D;&#x8FDB;&#xFF0C;&#x4E0D;&#x8981;&#x504F;&#x79BB;&#xFF0C;&#x4E0D;&#x8981;&#x4E3A;&#x4EBA;&#x6240;&#x5DE6;&#x53F3;&#xFF0C;&#x5305;&#x62EC;&#x4F60;&#x7684;&#x4E3B;&#x7BA1;&#x7684;&#x67D0;&#x4E9B;&#x6307;&#x4EE4;&#x5728;&#x5185;&#x3002;</p>
<p>&#x3000;&#x3000;&#x7B2C;7&#x6761;&#x94C1;&#x89C4;&#xFF1A;&#x5148;&#x6709;&#x4E13;&#x4E1A;&#x7CBE;&#x795E;&#xFF0C;&#x540E;&#x6709;&#x4EBA;&#x624D;</p>
<p>&#x3000;&#x3000;&#x5404;&#x4E2A;&#x90E8;&#x95E8;&#x4E2D;&#x6709;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x4EBA;&#xFF0C;&#x4F46;&#x5176;&#x4E2D;&#x603B;&#x6709;&#x4E9B;&#x4EBA;&#x7684;&#x5B58;&#x5728;&#x662F;&#x53EF;&#x6709;&#x53EF;&#x65E0;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x6CA1;&#x6709;&#x4E13;&#x4E1A;&#x7CBE;&#x795E;&#xFF0C;&#x4ED6;&#x4EEC;&#x65E0;&#x6CD5;&#x88AB;&#x4EBA;&#x6240;&#x501A;&#x91CD;&#xFF0C;&#x4ED6;&#x4EEC;&#x53EA;&#x662F;&#x90E8;&#x95E8;&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x7701;&#x7565;&#x53F7;&#xFF0C;&#x6CE8;&#x5B9A;&#x5C06;&#x8981;&#x5728;&#x53EA;&#x5BFB;&#x6C42;&#x7ED3;&#x679C;&#x7684;&#x6A21;&#x5F0F;&#x548C;&#x7A0B;&#x5E8F;&#x4E2D;&#x6D88;&#x5931;&#x3002;</p>
<p>&#x3000;&#x3000;&#x56E0;&#x4E3A;&#x4E13;&#x4E1A;&#x7CBE;&#x795E;&#xFF0C;&#x5C31;&#x662F;&#x670D;&#x52A1;&#x672C;&#x8EAB;&#xFF0C;&#x670D;&#x52A1;&#x65E2;&#x662F;&#x6307;&#x4E3A;&#x5BA2;&#x6237;&#x670D;&#x52A1;&#xFF0C;&#x53C8;&#x662F;&#x6307;&#x4E3A;&#x81EA;&#x5DF1;&#x5468;&#x56F4;&#x7684;&#x540C;&#x4E8B;&#x670D;&#x52A1;&#x3002;</p>
<p>&#x3000;&#x3000;&#x7B2C;8&#x6761;&#x94C1;&#x89C4;&#xFF1A;&#x89C4;&#x8303;&#x5C31;&#x662F;&#x6743;&#x5A01;&#xFF0C;&#x89C4;&#x8303;&#x662F;&#x4E00;&#x79CD;&#x7CBE;&#x795E;</p>
<p>&#x3000;&#x3000;&#x6709;&#x7684;&#x4EBA;&#x505A;&#x4E8B;&#x6C38;&#x8FDC;&#x4E0D;&#x80FD;&#x89C4;&#x8303;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x628A;&#x5B83;&#x89C6;&#x4E3A;&#x662F;&#x5FC5;&#x987B;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x4ED6;&#x4EEC;&#x6C38;&#x8FDC;&#x53D7;&#x5230;&#x6253;&#x538B;&#xFF0C;&#x6210;&#x7EE9;&#x603B;&#x662F;&#x88AB;&#x4EBA;&#x5426;&#x5B9A;&#x3002;</p>
<p>&#x3000;&#x3000;&#x89C4;&#x8303;&#x662F;&#x4E00;&#x79CD;&#x7CBE;&#x795E;&#xFF0C;&#x4E00;&#x79CD;&#x53EF;&#x8D35;&#x7684;&#x4E60;&#x60EF;&#xFF0C;&#x8FD9;&#x662F;&#x5B83;&#x4E0D;&#x5BB9;&#x6613;&#x517B;&#x6210;&#x7684;&#x539F;&#x56E0;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x6CA1;&#x6709;&#x89C4;&#x8303;&#xFF0C;&#x5C31;&#x6CA1;&#x6709;&#x6743;&#x5A01;&#xFF0C;&#x89C4;&#x8303;&#x610F;&#x5473;&#x7740;&#x4F60;&#x4E0D;&#x4F46;&#x61C2;&#x5F97;&#x505A;&#x4EBA;&#x548C;&#x505A;&#x4E8B;&#xFF0C;&#x800C;&#x4E14;&#x61C2;&#x5F97;&#x5982;&#x4F55;&#x505A;&#x597D;&#x5B83;&#x4EEC;&#x3002;</p>
<p>&#x3000;&#x3000;&#x7B2C;9&#x6761;&#x94C1;&#x89C4;&#xFF1A;&#x4E3B;&#x52A8;&#x5C31;&#x662F;&#x6548;&#x7387;&#xFF0C;&#x4E3B;&#x52A8;&#x3001;&#x4E3B;&#x52A8;&#x3001;&#x518D;&#x4E3B;&#x52A8;</p>
<p>&#x3000;&#x3000;&#x4E3B;&#x52A8;&#x7684;&#x4EBA;&#x662F;&#x6700;&#x806A;&#x660E;&#x7684;&#x4EBA;&#xFF0C;&#x662F;&#x56E2;&#x961F;&#x4E2D;&#x6700;&#x597D;&#x7684;&#x4F19;&#x4F34;&#xFF0C;&#x662F;&#x4EBA;&#x4EBA;&#x90FD;&#x60F3;&#x8981;&#x6709;&#x7684;&#x670B;&#x53CB;&#x3002;&#x6C38;&#x8FDC;&#x8981;&#x8BB0;&#x4F4F;&#xFF0C;&#x4E3B;&#x52A8;&#x7CBE;&#x795E;&#x662F;&#x4F60;&#x6700;&#x597D;&#x7684;&#x8001;&#x5E08;&#x3002;&#x5728;&#x56F0;&#x96BE;&#x7684;&#x65F6;&#x5019;&#x80FD;&#x591F;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x7684;&#xFF0C;&#x662F;&#x4E3B;&#x52A8;&#x800C;&#x4E0D;&#x662F;&#x8FD0;&#x6C14;&#x3002;</p>
<p>&#x3000;&#x3000;&#x7B2C;10&#x6761;&#x94C1;&#x89C4;&#xFF1A;&#x4EFB;&#x4F55;&#x4EBA;&#x90FD;&#x53EF;&#x6210;&#x4E3A;&#x8001;&#x5E08;</p>
<p>&#x3000;&#x3000;&#x56E0;&#x4E3A;&#x62C5;&#x5FC3;&#x72AF;&#x9519;&#x8BEF;&#x6216;&#x662F;&#x4E3A;&#x4E86;&#x5BFB;&#x627E;&#x5FC3;&#x7406;&#x4E0A;&#x7684;&#x5B89;&#x5168;&#x611F;&#xFF0C;&#x4EBA;&#x4EEC;&#x5E0C;&#x671B;&#x6709;&#x4E2A;&#x4EBA;&#x80FD;&#x4F9D;&#x9760;&#xFF0C;&#x80FD;&#x7ED9;&#x4E88;&#x6307;&#x70B9;&#xFF0C;&#x8FD9;&#x662F;&#x5BF9;&#x7684;&#xFF0C;&#x95EE;&#x9898;&#x662F;&#x6709;&#x4EBA;&#x603B;&#x662F;&#x9519;&#x5C06;&#x9886;&#x5BFC;&#x5F53;&#x6210;&#x552F;&#x4E00;&#x7684;&#x8001;&#x5E08;&#x3002;&#x59D1;&#x4E14;&#x4E0D;&#x8BF4;&#x8EAB;&#x4E3A;&#x9886;&#x5BFC;&#x7684;&#x8001;&#x5E08;&#x5F80;&#x5F80;&#x4E0D;&#x559C;&#x6B22;&#x7B28;&#x5C0F;&#x5B69;&#x8FD9;&#x4E00;&#x60E8;&#x75DB;&#x7684;&#x6559;&#x8BAD;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;&#x56E2;&#x961F;&#x4E2D;&#x4EFB;&#x4F55;&#x4EBA;&#x90FD;&#x53EF;&#x6210;&#x4E3A;&#x4F60;&#x7684;&#x8001;&#x5E08;&#xFF0C;&#x53EA;&#x8981;&#x4F60;&#x865A;&#x5FC3;&#x6C42;&#x6559;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4E3A;&#x4E86;&#x8FBE;&#x6210;&#x66F2;&#x7EBF;&#x6551;&#x56FD;&#x7684;&#x5176;&#x5B83;&#x76EE;&#x7684;&#x3002;&#x56E0;&#x4E3A;&#x4F60;&#x9700;&#x8981;&#x7684;&#x53EA;&#x662F;&#x77E5;&#x8BC6;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x8001;&#x5E08;&#x3002;</p>
<p>&#x3000;&#x3000;&#x7B2C;11&#x6761;&#x94C1;&#x89C4;&#xFF1A;&#x505A;&#x4E8B;&#x4E09;&#x8981;&#x7D20;&#xFF0C;&#x8BA1;&#x5212;&#x3001;&#x76EE;&#x6807;&#x548C;&#x65F6;&#x95F4;</p>
<p>&#x3000;&#x3000;&#x6C38;&#x8FDC;&#x8981;&#x6709;&#x8BA1;&#x5212;&#xFF0C;&#x6C38;&#x8FDC;&#x8981;&#x77E5;&#x9053;&#x76EE;&#x6807;&#xFF0C;&#x6C38;&#x8FDC;&#x4E0D;&#x8981;&#x5FD8;&#x4E86;&#x770B;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x3000;&#x3000;&#x7B2C;12&#x6761;&#x94C1;&#x89C4;&#xFF1A;&#x4E0D;&#x8981;&#x89E3;&#x91CA;&#xFF0C;&#x8981;&#x7ED3;&#x679C;</p>
<p>&#x3000;&#x3000;&#x7ADE;&#x4E89;&#x793E;&#x4F1A;&#x4E2D;&#xFF0C;&#x8BB8;&#x591A;&#x65F6;&#x5019;&#xFF0C;&#x89E3;&#x91CA;&#x662F;&#x6CA1;&#x6709;&#x610F;&#x4E49;&#x7684;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4F60;&#x60F3;&#x63A8;&#x5378;&#x6216;&#x8981;&#x522B;&#x4EBA;&#x6765;&#x627F;&#x62C5;&#x8D23;&#x4EFB;&#x3002;</p>
<p>&#x3000;&#x3000;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x5E0C;&#x671B;&#x770B;&#x5230;&#x6700;&#x540E;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x90A3;&#x4E48;&#x9996;&#x5148;&#x8981;&#x505A;&#x7684;&#x662F;&#x5C3D;&#x53EF;&#x80FD;&#x53BB;&#x6539;&#x53D8;&#x8FC7;&#x7A0B;&#x3002;&#x6C38;&#x8FDC;&#x8BB0;&#x4F4F;&#xFF1A;&#x4E1A;&#x7EE9;&#x4F1A;&#x8BF4;&#x8BDD;&#xFF0C;&#x6210;&#x5C31;&#x4F1A;&#x8BF4;&#x8BDD;&#x3002;</p>
<p>&#x3000;&#x3000;&#x7B2C;13&#x6761;&#x94C1;&#x89C4;&#xFF1A;&#x4E0D;&#x8981;&#x7F16;&#x9020;&#x7ED3;&#x679C;&#xFF0C;&#x8981;&#x5377;&#x8D77;&#x8896;&#x5B50;&#x5E72;&#x6D3B;</p>
<p>&#x3000;&#x3000;&#x4E0D;&#x8981;&#x7528;&#x53EF;&#x6015;&#x7684;&#x7ED3;&#x679C;&#x5413;&#x552C;&#x81EA;&#x5DF1;&#x6216;&#x662F;&#x5413;&#x552C;&#x522B;&#x4EBA;&#xFF0C;&#x9996;&#x5148;&#x5377;&#x8D77;&#x8896;&#x5B50;&#x53BB;&#x5E72;&#x6D3B;&#x3002;&#x53EA;&#x6709;&#x8FD9;&#x6837;&#x624D;&#x77E5;&#x9053;&#x7ED3;&#x679C;&#x662F;&#x5426;&#x771F;&#x7684;&#x5F88;&#x53EF;&#x6015;&#xFF0C;&#x7ECF;&#x9A8C;&#x8868;&#x660E;&#xFF0C;95%&#x4EE5;&#x4E0A;&#x7684;&#x53EF;&#x6015;&#x731C;&#x6D4B;&#x4F1A;&#x56E0;&#x4E3A;&#x5377;&#x8D77;&#x8896;&#x5B50;&#x5E72;&#x6D3B;&#x800C;&#x81EA;&#x7136;&#x6D88;&#x5931;&#x3002;</p>
<p>&#x3000;&#x3000;&#x7B2C;14&#x6761;&#x94C1;&#x89C4;&#xFF1A;&#x63A8;&#x8BFF;&#x65E0;&#x6548;</p>
<p>&#x3000;&#x3000;&#x5728;&#x5931;&#x8D25;&#x9762;&#x524D;&#xFF0C;&#x5728;&#x9519;&#x8BEF;&#x9762;&#x524D;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x77E5;&#x9053;&#x6700;&#x4E0D;&#x597D;&#x7684;&#x505A;&#x6CD5;&#x5C31;&#x662F;&#x63A8;&#x8BFF;&#xFF0C;&#x800C;&#x63A8;&#x8BFF;&#x5728;&#x56E2;&#x961F;&#x4E2D;&#x662F;&#x65E0;&#x6548;&#x7684;&#x3002;</p>
<p>&#x3000;&#x3000;&#x56E2;&#x961F;&#x597D;&#x6BD4;&#x4E00;&#x6839;&#x94FE;&#x6761;&#xFF0C;&#x603B;&#x662F;&#x63A8;&#x8BFF;&#x7684;&#x4EBA;&#x72B9;&#x5982;&#x94FE;&#x6761;&#x4E2D;&#x7684;&#x6C99;&#x5B50;&#xFF0C;&#x4F1A;&#x8BA9;&#x5176;&#x4ED6;&#x4EBA;&#x611F;&#x89C9;&#x7279;&#x522B;&#x522B;&#x626D;&#xFF0C;&#x5E76;&#x4E14;&#x4F1A;&#x8BA9;&#x4EBA;&#x52A0;&#x6DF1;&#x5BF9;&#x4F60;&#x6240;&#x72AF;&#x9519;&#x8BEF;&#x7684;&#x5370;&#x8C61;&#x3002;</p>
<p>&#x3000;&#x3000;&#x7B2C;15&#x6761;&#x94C1;&#x89C4;&#xFF1A;&#x7B80;&#x5355;&#x3001;&#x7B80;&#x5355;&#x3001;&#x518D;&#x7B80;&#x5355;</p>
<p>&#x3000;&#x3000;&#x4E0D;&#x8981;&#x592A;&#x5938;&#x5F20;&#xFF0C;&#x4E0D;&#x8981;&#x865A;&#x5F20;&#x58F0;&#x52BF;&#xFF0C;&#x66F4;&#x4E0D;&#x8981;&#x8282;&#x5916;&#x751F;&#x679D;&#x3002;&#x5BFB;&#x627E;&#x6377;&#x5F84;&#x662F;&#x63D0;&#x9AD8;&#x5DE5;&#x4F5C;&#x6548;&#x7387;&#x7684;&#x9996;&#x8981;&#x65B9;&#x6CD5;&#x3002;&#x540C;&#x6837;&#x7684;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x80FD;&#x5B8C;&#x6210;&#x5F97;&#x6BD4;&#x522B;&#x4EBA;&#x66F4;&#x7B80;&#x5355;&#xFF0C;&#x5C31;&#x662F;&#x597D;&#x6837;&#x7684;&#x3002;</p>
<p>&#x3000;&#x3000;&#x7B2C;16&#x6761;&#x94C1;&#x89C4;&#xFF1A;&#x505A;&#x8DB3;&#x4E00;&#x767E;&#x5206;&#x662F;&#x672C;&#x5206;</p>
<p>&#x3000;&#x3000;&#x4E00;&#x767E;&#x5206;&#x662F;&#x5B8C;&#x7F8E;&#x7684;&#x8868;&#x73B0;&#xFF0C;&#x8FFD;&#x6C42;&#x987E;&#x5BA2;&#x6EE1;&#x610F;&#xFF0C;&#x8FFD;&#x6C42;&#x5B8C;&#x7F8E;&#x670D;&#x52A1;&#x3002;&#x4E0D;&#x8981;&#x4EE5;&#x4E3A;&#x8FD9;&#x662F;&#x9AD8;&#x8981;&#x6C42;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x80FD;&#x5B9E;&#x73B0;&#x4E00;&#x767E;&#x5206;&#xFF0C;&#x4E0D;&#x8FC7;&#x662F;&#x521A;&#x521A;&#x5B8C;&#x6210;&#x4E86;&#x4EFB;&#x52A1;&#x800C;&#x5DF2;&#x3002;</p>
<p>&#x3000;&#x3000;&#x7B2C;17&#x6761;&#x94C1;&#x89C4;&#xFF1A;&#x505A;&#x4EBA;&#x8981;&#x4F4E;&#x8C03;&#xFF0C;&#x505A;&#x4E8B;&#x8981;&#x9AD8;&#x8C03;&#xFF0C;&#x4E0D;&#x8981;&#x98A0;&#x5012;&#x8FC7;&#x6765;</p>
<p>&#x3000;&#x3000;&#x4F4E;&#x8C03;&#x505A;&#x4EBA;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x4F60;&#x5468;&#x56F4;&#x4FDD;&#x6301;&#x5065;&#x5EB7;&#x7684;&#x7A7A;&#x6C14;&#xFF0C;&#x800C;&#x9AD8;&#x8C03;&#x505A;&#x4E8B;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x8D62;&#x5F97;&#x652F;&#x6301;&#x548C;&#x58F0;&#x8A89;&#x3002;</p>
<p>&#x3000;&#x3000;&#x7B2C;18&#x6761;&#x94C1;&#x89C4;&#xFF1A;&#x6C9F;&#x901A;&#x80FD;&#x6D88;&#x9664;&#x4E00;&#x5207;&#x969C;&#x788D;</p>
<p>&#x3000;&#x3000;&#x6C9F;&#x901A;&#x80FD;&#x529B;&#x662F;&#x4ECE;&#x4E1A;&#x4EBA;&#x5458;&#x7684;&#x8D77;&#x7801;&#x7D20;&#x8D28;&#x3002;&#x4E0D;&#x8981;&#x6015;&#x6C9F;&#x901A;&#x4E2D;&#x7684;&#x5C0F;&#x9EBB;&#x70E6;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x60F3;&#x9762;&#x5BF9;&#x66F4;&#x5927;&#x7684;&#x9EBB;&#x70E6;&#xFF0C;&#x5C31;&#x8981;&#x6C9F;&#x901A;&#xFF0C;&#x5C31;&#x8981;&#x534F;&#x8C03;&#x5468;&#x56F4;&#x7684;&#x4E00;&#x5207;&#x3002;&#x987A;&#x7545;&#x4E0D;&#x4F1A;&#x4ECE;&#x5929;&#x800C;&#x964D;&#xFF0C;&#x5B83;&#x662F;&#x6C9F;&#x901A;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x3000;&#x3000;&#x7B2C;19&#x6761;&#x94C1;&#x89C4;&#xFF1A;&#x4ECE;&#x4E1A;&#x4EBA;&#x5458;&#x9996;&#x5148;&#x662F;&#x67B6;&#x5BA3;&#x4F20;&#x673A;&#x5668;</p>
<p>&#x3000;&#x3000;&#x4F5C;&#x4E3A;&#x4F01;&#x4E1A;&#x6D41;&#x52A8;&#x7684;&#x5E7F;&#x544A;&#x7A97;&#x53E3;&#xFF0C;&#x4E0D;&#x8BBA;&#x7A7F;&#x884C;&#x4E8E;&#x5927;&#x8857;&#x5C0F;&#x5DF7;&#x8FD8;&#x662F;&#x6DF1;&#x5165;&#x5230;&#x57CE;&#x9547;&#x4E61;&#x6751;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x4E00;&#x8DEF;&#x53E3;&#x6C34;&#x4E00;&#x8DEF;&#x6B4C;&#xFF0C;&#x4E0D;&#x9057;&#x4F59;&#x529B;&#x5730;&#x505A;&#x516C;&#x53F8;&#x4EE5;&#x53CA;&#x4EA7;&#x54C1;&#x7684;&#x5439;&#x9F13;&#x624B;&#xFF0C;&#x8FD9;&#x662F;&#x4F60;&#x6700;&#x57FA;&#x672C;&#x7684;&#x5DE5;&#x4F5C;&#x4EFB;&#x52A1;&#x3002;</p>
<p>&#x3000;&#x3000;&#x5F53;&#x7136;&#xFF0C;&#x9F13;&#x52A8;&#x522B;&#x4EBA;&#x4E4B;&#x524D;&#xFF0C;&#x5148;&#x8981;&#x9F13;&#x52A8;&#x81EA;&#x5DF1;&#xFF01;</p>
<p>&#x3000;&#x3000;&#x7B2C;20&#x6761;&#x94C1;&#x89C4;&#xFF1A;&#x6C38;&#x8FDC;&#x4FDD;&#x6301;&#x8FDB;&#x53D6;&#xFF0C;&#x4FDD;&#x6301;&#x5F00;&#x653E;&#x5FC3;&#x6001;</p>
<p>&#x3000;&#x3000;&#x8C26;&#x865A;&#x662F;&#x62E5;&#x6709;&#x5F00;&#x653E;&#x5FC3;&#x6001;&#x7684;&#x8868;&#x73B0;&#x3002;</p>
<p>&#x3000;&#x3000;&#x5728;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x9500;&#x552E;&#x90E8;&#x95E8;&#x4E2D;&#xFF0C;&#x6700;&#x8D5A;&#x4FBF;&#x5B9C;&#x7684;&#x662F;&#x4E24;&#x79CD;&#x4EBA;&#xFF0C;&#x4E00;&#x79CD;&#x4EBA;&#x52C7;&#x4E8E;&#x5F00;&#x62D3;&#x8FDB;&#x53D6;&#xFF0C;&#x6536;&#x83B7;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#xFF0C;&#x5931;&#x8D25;&#x662F;&#x4E0A;&#x53F8;&#x6216;&#x8001;&#x677F;&#x7684;&#xFF0C;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x79CD;&#x4EBA;&#x628A;&#x81EA;&#x5DF1;&#x7684;&#x9000;&#x8DEF;&#x7559;&#x7ED9;&#x4E86;&#x8001;&#x677F;&#x6216;&#x4E0A;&#x53F8;&#x53BB;&#x7167;&#x987E;&#x3002;&#x53E6;&#x4E00;&#x79CD;&#x4EBA;&#x662F;&#x6709;&#x5F00;&#x653E;&#x5FC3;&#x6001;&#x7684;&#x4EBA;&#xFF0C;&#x4ED6;&#x4EEC;&#x8C26;&#x865A;&#xFF0C;&#x4ED6;&#x4EEC;&#x53EF;&#x4EE5;&#x6709;&#x6548;&#x63A5;&#x53D7;&#x522B;&#x4EBA;&#x7684;&#x770B;&#x6CD5;&#xFF0C;&#x6240;&#x4EE5;&#x4ED6;&#x4EEC;&#x7684;&#x6210;&#x529F;&#x6BD4;&#x522B;&#x4EBA;&#x5FEB;&#x5F97;&#x591A;&#xFF0C;&#x81EA;&#x7136;&#x6536;&#x83B7;&#x4E5F;&#x5927;&#x3002;</p>

      
    </div>
    <footer class="article-footer">
      <a data-url="http://sarieltang.github.io/2015/01/06/转/2015-01-06/index/" data-id="ciuruin9g0003pgfyam9q8yku" class="article-share-link">Share</a>
      
      
    </footer>
  </div>
  
    
<nav id="article-nav">
  
    <a href="/2015/04/27/知识点小结/2015-04-27/index/" id="article-nav-newer" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Newer</strong>
      <div class="article-nav-title">
        
          应用程序中内存分配概要
        
      </div>
    </a>
  
  
    <a href="/2014/12/27/知识点小结/2014-12-27/index/" id="article-nav-older" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Older</strong>
      <div class="article-nav-title">Unix系统与Windows系统下的常用命令整理</div>
    </a>
  
</nav>

  
</article>

</section>
        
          <aside id="sidebar">
  
    
  <div class="widget-wrap">
    <h3 class="widget-title">分类</h3>
    <div class="widget">
      <ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/总结分析/">总结分析</a><span class="category-list-count">4</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/知识点小结/">知识点小结</a><span class="category-list-count">9</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/转/">转</a><span class="category-list-count">1</span></li></ul>
    </div>
  </div>


  
    

  
    
  
    
  <div class="widget-wrap">
    <h3 class="widget-title">归档</h3>
    <div class="widget">
      <ul class="archive-list"><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/10/">十月 2016</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/05/">五月 2016</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/04/">四月 2016</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2015/12/">十二月 2015</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2015/09/">九月 2015</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2015/07/">七月 2015</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2015/06/">六月 2015</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2015/05/">五月 2015</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2015/04/">四月 2015</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2015/01/">一月 2015</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2014/12/">十二月 2014</a></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">最新文章</h3>
    <div class="widget">
      <ul>
        
          <li>
            <a href="/2016/10/26/hello-world/">首页</a>
          </li>
        
          <li>
            <a href="/2016/10/25/总结分析/2016-10-25/index/">Method Swizzling（方法替换）</a>
          </li>
        
          <li>
            <a href="/2016/05/19/知识点小结/2016-05-19/index/">系统返回手势与ScrollView的冲突</a>
          </li>
        
          <li>
            <a href="/2016/05/18/知识点小结/2016-05-18/index/">iOS字符串常量的使用</a>
          </li>
        
          <li>
            <a href="/2016/04/28/总结分析/2016-04-28/index/">iOS性能调优总结</a>
          </li>
        
      </ul>
    </div>
  </div>

  
</aside>
        
      </div>
      <footer id="footer">
  
  <div class="outer">
    <div id="footer-info" class="inner">
      &copy; 2016 SarielTang<br>
      Powered by <a href="http://hexo.io/" target="_blank">Hexo</a>
    </div>
  </div>
</footer>
    </div>
    <nav id="mobile-nav">
  
    <a href="/" class="mobile-nav-link">Home</a>
  
    <a href="/archives" class="mobile-nav-link">Archives</a>
  
</nav>
    

<script src="//ajax.googleapis.com/ajax/libs/jquery/2.0.3/jquery.min.js"></script>


  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css">
  <script src="/fancybox/jquery.fancybox.pack.js"></script>


<script src="/js/script.js"></script>

  </div>
</body>
</html>